quote-app/app/controllers/quote_controller.rb

DELETE FROM "quotes" WHERE "quotes"."id" = $1  [["id", 3]]
---
    def destroy
        @Quote.destroy

SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_quote
        @Quote = Quote.find(params[:id])