quotes_api/app/controllers/quotes_controller.rb

SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_quote
        @quotes = Quote.find(params[:id])