quotes_api/app/controllers/quotes_controller.rb

    def index
        @quote = Quote.all
---
SELECT "quotes".* FROM "quotes"

    def show
        puts params.inspect
        @quote = Quote.find(params[:id])
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

   def create
    @quote = Quote.create(quote_params)
---
INSERT INTO "quotes" ("content", "author", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "blblblblb"], ["author", "Moroj"], ["category", "blblb"], ["created_at", "2019-01-23 15:02:36.771111"], ["updated_at", "2019-01-23 15:02:36.771111"]]

   def update
    @quote = Quote.find(params[:id])
    @quote.update_attributes(quote_params)
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "quotes" SET "content" = $1, "category" = $2, "updated_at" = $3 WHERE "quotes"."id" = $4  [["content", "bl"], ["category", "bl"], ["updated_at", "2019-01-23 15:02:56.200805"], ["id", 24]]

   def destroy
    @quote = Quote.find(params[:id])
    @quote.destroy
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "quotes" WHERE "quotes"."id" = $1  [["id", 25]]