auotes_api/app/controllers/quote_controller.rb

    def index
        @quote = Quote.all
---
SELECT "quotes".* FROM "quotes"

    def show
        @quote = Quote.find(params[:id])
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def destroy

        @quote = Quote.find(params[:id])
        @quote.destroy
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "quotes" WHERE "quotes"."id" = $1  [["id", 4]]

    def update
        @quote = Quote.find(params[:id])
        @quote.update_attributes(quote_params)
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "quotes" SET "content" = $1, "updated_at" = $2 WHERE "quotes"."id" = $3  [["content", "The expert at anything was once a beginner1111."], ["updated_at", "2019-01-23 15:01:38.250781"], ["id", 4]]