quote_api/app/controllers/quotes_controller.rb

        def create
            @Quote = Quote.create(quote_params)
---
INSERT INTO "quotes" ("content", "author", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

        def update
            @Quote.update_attributes(quote_params)
---
UPDATE "quotes" SET "content" = $1, "author" = $2, "updated_at" = $3 WHERE "quotes"."id" = $4  [["content", "Sometimes you win, sometimes you learn."], ["author", "Unknown"], ["updated_at", "2019-01-23 16:13:55.325030"], ["id", 2]]

        def destroy
            @Quote.destroy
---
DELETE FROM "quotes" WHERE "quotes"."id" = $1  [["id", 1]]

        def set_quote
            @Quote = Quote.find(params[:id])
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]