quotes_app/app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes"
---
    def index
        @quote= Quote.all

SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @quote = Quote.find(params[:id])

SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_quote
        @quote = Quote.find(params[:id])