api/app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes"
---
    def index

       @quote = Quote.all

SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @quote = Quote.find(params[:id])

SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "quotes" WHERE "quotes"."id" = $1  [["id", 1]]
---
    def destroy
        @quote = Quote.find(params[:id])
        @quote.destroy